# GetRegionsAssociatedToLayer Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..GetRegionsAssociatedToLayer Method
CompoundStructure Class See Also
---
Gets the set of region ids associated to a particular layer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<int> GetRegionsAssociatedToLayer(
	int layerIdx
)
```

Visual Basic
---
```text
Public Function GetRegionsAssociatedToLayer ( _
	layerIdx As Integer _
) As IList(Of Integer)
```

Visual C++
---
```text
public:
IList<int>^ GetRegionsAssociatedToLayer(
	int layerIdx
)
```

# ### Parameters
layerIdx
    Type: System..::..Int32 The index of a layer in this CompoundStructure.
# ### Return Value
An array of region ids which are associated to the specified layer.
# Remarks
Regions are associated to layers. In a vertically compound structure, more than one region may be associated to a single layer.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The layer index is out of range. |

# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace